<a href="https://colab.research.google.com/github/yumeniown/Software-Engineering-IT-Leaders-of-the-Future/blob/main/%D0%A0%D0%B0%D0%B1%D0%BE%D1%82%D0%B0_%D1%81_%D0%B1%D0%B4_%D0%B8%D0%B7_Python.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import sqlite3

In [ ]:
# Создаем подключение к базе данных (файл my_database.db будет создан)
connection = sqlite3.connect('my_database.db')
# connection.close()

In [ ]:
type(connection)

sqlite3.Connection

In [ ]:
cursor = connection.cursor()

# Создаем таблицу Users
cursor.execute('''
CREATE TABLE IF NOT EXISTS Users (
    id INTEGER PRIMARY KEY,
    username TEXT NOT NULL,
    email TEXT NOT NULL,
    age INTEGER
)
''')

# Сохраняем изменения и закрываем соединение
connection.commit()

In [ ]:
# Выбираем всех пользователей
cursor.execute('SELECT * FROM Users')
users = cursor.fetchall()

# Выводим результаты
for user in users:
  print(user)

In [ ]:
# Выполняем запрос к системной таблице sqlite_master
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
tables = cursor.fetchall()

# Выводим названия всех таблиц
for table in tables:
    print(table[0])

Users

In [ ]:
# Выполняем запрос к системной таблице sqlite_master
cursor.execute("SELECT name FROM sqlite_master")
tables = cursor.fetchall()

# Выводим названия всех таблиц
for table in tables:
    print(table)

('Users',)

In [ ]:
# Получаем информацию о столбцах для указанной таблицы
cursor.execute("PRAGMA table_info(Users)")
columns_info = cursor.fetchall()

# Выводим названия столбцов
columns = []
for column_info in columns_info:
    columns.append(column_info[1])

print(columns)

['id', 'username', 'email', 'age']

In [ ]:
columns_info

[(0, 'id', 'INTEGER', 0, None, 0),
 (1, 'username', 'TEXT', 1, None, 0),
 (2, 'email', 'TEXT', 1, None, 0),
 (3, 'age', 'INTEGER', 0, None, 0)]

In [ ]:
# Выбираем всех пользователей
cursor.execute('SELECT * FROM Users')
users = cursor.fetchall()

# Выводим результаты
for user in users:
  print(user)

In [ ]:
# Добавляем нового пользователя
cursor.execute('INSERT INTO Users (username, email, age) VALUES (?, ?, ?)', ('newuser', 'newuser@example.com', 28));

In [ ]:
# Выбираем всех пользователей
cursor.execute('SELECT * FROM Users')
users = cursor.fetchall()

# Выводим результаты
for user in users:
  print(user)

(None, 'newuser', 'newuser@example.com', 28)

In [ ]:
connection.close()

In [ ]:
connection = sqlite3.connect('my_database.db')
cursor = connection.cursor()

In [ ]:
# Выбираем всех пользователей
cursor.execute('SELECT * FROM Users')
users = cursor.fetchall()

# Выводим результаты
for user in users:
  print(user)

DatabaseError: database disk image is malformed

In [ ]:
cursor.execute('DROP table if exists Users ')

DatabaseError: database disk image is malformed

In [ ]:
# Добавляем нового пользователя
cursor.execute('INSERT INTO Users (username, email, age) VALUES (?, ?, ?)', ('newuser', 'newuser@example.com', 28));
connection.commit()

In [ ]:
# Выбираем всех пользователей
cursor.execute('SELECT * FROM Users')
users = cursor.fetchall()

# Выводим результаты
for user in users:
  print(user)

(1, 'newuser', 'newuser@example.com', 28)

In [ ]:
# SQL-запрос для вставки строки в таблицу Users
sql_query = 'INSERT INTO Users (username, email, age) VALUES (?, ?, ?)'

# Список кортежей с данными для вставки
data_to_insert = [
    ('user1', 'user1@example.com', 25),
    ('user2', 'user2@example.com', 30),
    ('user3', 'user3@example.com', 22)
]

# Вставляем несколько строк сразу
cursor.executemany(sql_query, data_to_insert)

# Сохраняем изменения
connection.commit()

In [ ]:
# Выбираем всех пользователей
cursor.execute('SELECT * FROM Users')
users = cursor.fetchall()

# Выводим результаты
for user in users:
  print(user)

(1, 'newuser', 'newuser@example.com', 28)
(2, 'user1', 'user1@example.com', 25)
(3, 'user2', 'user2@example.com', 30)
(4, 'user3', 'user3@example.com', 22)

In [ ]:
# Обновляем возраст пользователя "newuser"
cursor.execute('UPDATE Users SET age = ? WHERE username = ?', (29, 'newuser'))

# Сохраняем изменения
connection.commit()

In [ ]:
# Выбираем всех пользователей
cursor.execute('SELECT * FROM Users')
users = cursor.fetchall()

# Выводим результаты
for user in users:
  print(user)

(1, 'newuser', 'newuser@example.com', 29)
(2, 'user1', 'user1@example.com', 25)
(3, 'user2', 'user2@example.com', 30)
(4, 'user3', 'user3@example.com', 22)

In [ ]:
# Обновляем возраст пользователя "newuser"
cursor.execute('UPDATE Users SET age = ?, email = ? WHERE username = ?', (59, 'newuser@inn.ru', 'newuser'))

# Сохраняем изменения
connection.commit()

In [ ]:
# Выбираем всех пользователей
cursor.execute('SELECT * FROM Users')
users = cursor.fetchall()

# Выводим результаты
for user in users:
  print(user)

(1, 'newuser', 'newuser@inn.ru', 59)
(2, 'user1', 'user1@example.com', 25)
(3, 'user2', 'user2@example.com', 30)
(4, 'user3', 'user3@example.com', 22)

In [ ]:

cursor.execute('DELETE FROM Users WHERE username = ?', ('newuser',))

# Сохраняем изменения и закрываем соединение
connection.commit()

In [ ]:
# Выбираем всех пользователей
cursor.execute('SELECT * FROM Users')
users = cursor.fetchall()

# Выводим результаты
for user in users:
  print(user)

(2, 'user1', 'user1@example.com', 25)
(3, 'user2', 'user2@example.com', 30)
(4, 'user3', 'user3@example.com', 22)

In [ ]:
# Выбираем имена и возраст пользователей старше 25 лет
cursor.execute('SELECT username, age FROM Users WHERE age >= ?', (25,))
results = cursor.fetchall()

for row in results:
  print(row)

('user1', 25)
('user2', 30)

In [ ]:
c = (25 - 5,)

In [ ]:
type(c)

tuple

In [ ]:
c

(20,)

In [ ]:
# Выбираем и сортируем пользователей по возрасту по убыванию
cursor.execute('SELECT username, age FROM Users ORDER BY age DESC')
results = cursor.fetchall()

for row in results:
  print(row)

('user2', 30)
('user1', 25)
('user3', 22)

In [ ]:
# Выбираем и сортируем пользователей по возрасту по убыванию
cursor.execute('SELECT username, age FROM Users ORDER BY age ASC')
results = cursor.fetchall()

for row in results:
  print(row)

('user3', 22)
('user1', 25)
('user2', 30)

In [ ]:
# Выбираем и сортируем пользователей по возрасту по убыванию
cursor.execute('SELECT username, age FROM Users ORDER BY age')
results = cursor.fetchall()

for row in results:
  print(row)

('user3', 22)
('user1', 25)
('user2', 30)

In [ ]:
# Выбираем и сортируем пользователей по возрасту по убыванию
cursor.execute('SELECT username, age FROM Users ORDER BY username DESC')
results = cursor.fetchall()

for row in results:
  print(row)

('user3', 22)
('user2', 30)
('user1', 25)

### Продолжение лекции

In [ ]:
import sqlite3

In [ ]:
connection = sqlite3.connect('my_database.db')

In [ ]:
cursor = connection.cursor()

# Создаем таблицу Users
cursor.execute('''
CREATE TABLE IF NOT EXISTS Users (
    id INTEGER PRIMARY KEY,
    username TEXT NOT NULL,
    email TEXT NOT NULL,
    age INTEGER
)
''')

# Сохраняем изменения и закрываем соединение
connection.commit()

In [ ]:
# SQL-запрос для вставки строки в таблицу Users
sql_query = 'INSERT INTO Users (username, email, age) VALUES (?, ?, ?)'

# Список кортежей с данными для вставки
data_to_insert = [
    ('user1', 'user1@example.com', 25),
    ('user2', 'user2@example.com', 30),
    ('user3', 'user3@example.com', 22)
]

# Вставляем несколько строк сразу
cursor.executemany(sql_query, data_to_insert)

# Сохраняем изменения
connection.commit()

In [ ]:
# Выбираем всех пользователей
cursor.execute('SELECT * FROM Users')
users = cursor.fetchall()

users

[(1, 'user1', 'user1@example.com', 25),
 (2, 'user2', 'user2@example.com', 30),
 (3, 'user3', 'user3@example.com', 22)]

In [ ]:
# Выбираем всех пользователей
cursor.execute('SELECT * FROM Users')
users = cursor.fetchone()

users

(1, 'user1', 'user1@example.com', 25)

In [ ]:
users = cursor.fetchone()

users

In [ ]:
# Выбираем всех пользователей
cursor.execute('SELECT * FROM Users')
for i in range(3):
    print(cursor.fetchone())

# users

(1, 'user1', 'user1@example.com', 25)
(2, 'user2', 'user2@example.com', 30)
(3, 'user3', 'user3@example.com', 22)

In [ ]:
list(cursor.execute('SELECT * FROM Users'))

[(1, 'user1', 'user1@example.com', 25),
 (2, 'user2', 'user2@example.com', 30),
 (3, 'user3', 'user3@example.com', 22)]

In [ ]:
# SQL-запрос для вставки строки в таблицу Users
sql_query = 'INSERT INTO Users (username, email, age) VALUES (?, ?, ?)'

# Список кортежей с данными для вставки
data_to_insert = [
    ('user4', 'user4@example.com', 25),
    ('user5', 'user5@example.com', 30),
    ('user6', 'user6@example.com', 22)
]

# Вставляем несколько строк сразу
cursor.executemany(sql_query, data_to_insert)

# Сохраняем изменения
connection.commit()

In [ ]:
# Выбираем всех пользователей
cursor.execute('SELECT * FROM Users')
users = cursor.fetchall()

users

[(1, 'user1', 'user1@example.com', 25),
 (2, 'user2', 'user2@example.com', 30),
 (3, 'user3', 'user3@example.com', 22),
 (4, 'user4', 'user4@example.com', 25),
 (5, 'user5', 'user5@example.com', 30),
 (6, 'user6', 'user6@example.com', 22)]

In [ ]:
# Выбираем всех пользователей
cursor.execute('SELECT * FROM Users')
users = cursor.fetchmany(2)

users

[(1, 'user1', 'user1@example.com', 25), (2, 'user2', 'user2@example.com', 30)]

In [ ]:
users = cursor.fetchmany(3)

users

[(3, 'user3', 'user3@example.com', 22),
 (4, 'user4', 'user4@example.com', 25),
 (5, 'user5', 'user5@example.com', 30)]

In [ ]:
users = cursor.fetchmany(2)

users

[(6, 'user6', 'user6@example.com', 22)]

In [ ]:
# Выбираем всех пользователей
cursor.execute('SELECT * FROM Users')
users = cursor.fetchmany()

users

[(1, 'user1', 'user1@example.com', 25)]

In [ ]:
# Выполняем SQL-запрос
cursor.execute('SELECT * FROM Users')

# Перемещаем курсор на две строки вперед относительно текущей позиции
cursor.scroll(2, mode='relative')

# Извлекаем следующую строку после перемещения курсора
row = cursor.fetchone()
print(row)

AttributeError: 'sqlite3.Cursor' object has no attribute 'scroll'

In [ ]:
-- Создаем таблицу users:
CREATE TABLE users (
username VARCHAR(50),
password VARCHAR(50),
status VARCHAR(10));

-- Создаем таблицу users_profile:
CREATE TABLE users_profile (
username VARCHAR(50),
name VARCHAR(50),
address VARCHAR(50),
email VARCHAR(50));


INSERT INTO users values
('admin' , '7856', 'Active'),
('staff' , '90802', 'Active'),
('manager' , '35462', 'Inactive');

INSERT INTO users_profile values
('admin', 'Administrator' , 'Dhanmondi', 'admin@test.com' ) ,
('staff', 'Jakir Nayek' , 'Mirpur', 'zakir@test.com' ),
('manager', 'Mehr Afroz' , 'Eskaton', 'mehr@test.com' );





SELECT * FROM users;

SELECT * FROM users_profile;

WITH cte_users_profile AS
(
	SELECT *
  	FROM users_profile
  	WHERE username = 'staff'
)
SELECT * FROM cte_users_profile;

SELECT * FROM cte_users_profile;


-- в cte считаем активных и неактивных
WITH count_user_status AS
(
	SELECT
  		status,
  		COUNT(*) AS cnt
  	FROM users
  	GROUP BY status
)
SELECT cnt
FROM count_user_status
WHERE LOWER(status) = 'active';


-- выбрать всю информацию о пользователях у которых пароль из 5 цифр
WITH username_pass_5 AS
(
 	SELECT
  		username
  	FROM users
  	WHERE LENGTH(password) = 5
)
SELECT up.*
FROM users_profile AS up
--
JOIN username_pass_5 AS u
	ON up.username = u.username



SELECT *
FROM users_profile AS up
--
JOIN users AS u
	ON up.username = u.username


 --   WITH RECURSIVE

-- Создаем таблицу employees:
CREATE TABLE employees (
    employee_id INT,
    first_name VARCHAR(50),
    last_name VARCHAR(50),
    department_id INT,
    birthdate DATE
);
-- Создаем таблицу departments:
CREATE TABLE departments (
    department_id INT,
    department_name VARCHAR(50)
);



INSERT INTO departments (department_id, department_name)
VALUES
    (1, 'IT'),
    (2, 'HR'),
    (3, 'Sales');

INSERT INTO employees (employee_id, first_name, last_name, department_id, birthdate)
VALUES
    (1, 'John', 'Doe', 1, '1990-05-15'),
    (2, 'Jane', 'Smith', 1, '1985-03-22'),
    (3, 'Michael', 'Johnson', 2, '1992-08-10'),
    (4, 'Emily', 'Brown', 2, '1988-11-30'),
    (5, 'David', 'Lee', 3, '1995-07-05');



-- вывести информацию о сотрудниках из HR
SELECT
	e.*
FROM employees AS e
JOIN departments AS d
	ON e.department_id = d.department_id
WHERE d.department_name = 'HR'


SELECT
	e.*
FROM employees AS e
WHERE department_id IN (SELECT department_id
                        FROM departments
                        WHERE department_name IN ('HR', 'IT'))


SELECT
	*
FROM employees AS e
JOIN departments AS d
	ON e.department_id = d.department_id
-- JOIN departments AS d2
--	ON e.department_id = d2.department_id


-- EXISTS
SELECT * FROM employees WHERE first_name = 'John'
SELECT * FROM employees WHERE first_name = 'Jofghjkhn'

SELECt EXISTS (SELECT * FROM employees WHERE first_name = 'John');
SELECt EXISTS (SELECT * FROM employees WHERE first_name = 'Jofghjkhn');


INSERT INTO employees (employee_id, first_name, last_name, department_id, birthdate)
VALUES
    (6, 'Helen', 'Doe', 8, '1990-05-15'),
    (7, 'Tom', 'Smith', 9, '1985-03-22');

-- вывести сотрудников, у которых есть департамент
SELECT *
FROM employees
WHERE department_id IN (select department_id FROM departments)

SELECT *
FROM employees AS e
WHERE EXISTS (select *
              FROM departments AS d
              WHERE d.department_id = e.department_id)


SELECT
	*
FROM employees AS e
JOIN departments AS d
	ON e.department_id = d.department_id